'''
题目：请实现一个函数用来判断字符串是否表示数值（包括整数和小数）。
例如，字符串"+100","5e2","-123","3.1416"和"-1E-16"都表示数值。 
但是"12e","1a3.14","1.2.3","+-5"和"12e+4.3"都不是。
'''

# -*- coding:utf-8 -*-  正则表达式最快最简单
import re
class Solution:
    # s字符串
    def isNumeric(self, s):
        # write code here
        regex=re.compile(r'^ *[+-]?\d*\.?\d*([eE][+-]?\d+)? *$')
        return bool(regex.search(s))
        # 答案要求返回对错即可，所以用bool变量
'''
用例中“-.123”也算作数字，但我觉得不应该算，“-0.123”才算数字。
上面的答案是为了满足剑指offer的测试用例，我觉得应该改成
新答案 regex=re.compile(r'^ *[+-]?\d+\.?\d*([eE][+-]?\d+)? *$')    把第一个[+-]?后的/d*改成/d+
原答案 regex=re.compile(r'^ *[+-]?\d*\.?\d*([eE][+-]?\d+)? *$')
'''
